import Foundation

// 引数に2つの整数を取り、それらの和を返す関数「add」を定義してください。

// 定数「sum」を宣言し、「add」関数を使って3と5の和を代入してください。最後に変数「sum」の内容を出力してください。

// 引数に名前を意味する文字列を取り、「Hello, {名前}」という文字列を返す関数「greet」を定義してください。

// 定数「greeting」を宣言し、「greet」関数を使って「John」に挨拶する文字列を代入してください。最後に、変数「greeting」の内容を出力してください。

// 2つの整数の積を計算するクロージャ「multiply」を定義してください。

// 定数「product」を宣言し、「multiply」クロージャを使って4と7の積を代入してください。最後に定数「product」の内容を出力してください。

// 2つの整数の差を計算するクロージャ「subtract」を定義してください。ただし、最初の引数をfirstNumber,2つ目の引数をsecondNumberとして定義し、fisrtNumberからsecoundNumberを引くクロージャとして定義してください。

// 変数「difference」を宣言し、「subtract」クロージャを使って9から3を引いた差を代入してください。
