import Foundation

// 新しいプロトコル「Drivable」を定義し、その中に「maxSpeed」という最高速度を表すInt型のプロパティを追加してください。さらに「drive()」というメソッドを追加してください。

/*
 クラス「Car」を定義し、その中に「model」というString型のプロパティを追加し、初期化メソッドを実装してください。また、「Drivable」プロトコルに準拠させてください。
 「{model}の車が走行中です。最高速度は時速約{maxSpeed}キロです。」と出力する関数「drive」を実装してください。
 最高速度は200キロを指定してください。
 */

/*
 クラス「Bicycle」を定義し、その中に「brand」というString型のプロパティを追加し、初期化メソッドを実装してください。また、「Drivable」プロトコルに準拠させてください。
 「{brand}の自転車が走行中です。最高速度は時速約{maxSpeed}キロです。」と出力する関数「drive」を実装してください。
 最高速度は40キロを指定してください。
 */

// 新しいプロトコル「Printable」を定義し、その中に「printDescription()」というメソッドを追加してください。

// プロトコル「Printable」にデフォルト実装を追加し、「説明なし」を出力するようにしてください。

/*
 クラス「Document」を定義し、「Printable」プロトコルに準拠させ、「title」と「content」というプロパティを追加してください。初期化メソッドも実装してください。
 関数「printDescription」を実行すると「タイトル: {title}, 内容: {content}」を出力するように実装しなさい
 */
